[Killed] Conditional (false) mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:22:16
 
     public int Divide(int a, int b)
     {
-        return b != 0 ? a / b : throw new DivideByZeroException("Denominator cannot be zero.");
+        return (false?a / b :throw new DivideByZeroException("Denominator cannot be zero."));
     }
 
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroDenominator_WhenDivide_ThenReturnsQuotient

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:22:16
 
     public int Divide(int a, int b)
     {
-        return b != 0 ? a / b : throw new DivideByZeroException("Denominator cannot be zero.");
+        return b == 0 ? a / b : throw new DivideByZeroException("Denominator cannot be zero.");
     }
 
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroDenominator_WhenDivide_ThenReturnsQuotient

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:27:16
 
     public int HCF(int a, int b)
     {
-        while (b != 0)
+        while (b == 0)
         {
             int temp = b;
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNegativeInputs_WhenHCF_ThenReturnsPositiveHCF; ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple; ProjectTests.BasicArithmaticFunctionsTests.GivenTwoIntegers_WhenHCF_ThenReturnsGreatestCommonFactor

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:30:17
         while (b != 0)
         {
             int temp = b;
-            b = a % b;
+            b = a * b;
             a = temp;
         }
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNegativeInputs_WhenHCF_ThenReturnsPositiveHCF; ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple; ProjectTests.BasicArithmaticFunctionsTests.GivenTwoIntegers_WhenHCF_ThenReturnsGreatestCommonFactor

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:38:13
 
     public int LCM(int a, int b)
     {
-        if (a == 0 || b == 0)
+        if (a != 0 || b == 0)
         {
             throw new ArgumentException("Numbers must be non-zero.");
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple; ProjectTests.BasicArithmaticFunctionsTests.GivenZeroInput_WhenLCM_ThenThrowsArgumentException

[Killed] Negate expression
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:38:13
 
     public int LCM(int a, int b)
     {
-        if (a == 0 || b == 0)
+        if (!(a == 0 || b == 0))
         {
             throw new ArgumentException("Numbers must be non-zero.");
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple; ProjectTests.BasicArithmaticFunctionsTests.GivenZeroInput_WhenLCM_ThenThrowsArgumentException

[Killed] Statement mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:40:13
     {
         if (a == 0 || b == 0)
         {
-            throw new ArgumentException("Numbers must be non-zero.");
+            ;
         }
         return Math.Abs(a * b) / HCF(a, b);
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenZeroInput_WhenLCM_ThenThrowsArgumentException

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:42:16
         {
             throw new ArgumentException("Numbers must be non-zero.");
         }
-        return Math.Abs(a * b) / HCF(a, b);
+        return Math.Abs(a * b) * HCF(a, b);
     }
 }
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BasicArithmaticFunctions.cs:42:25
         {
             throw new ArgumentException("Numbers must be non-zero.");
         }
-        return Math.Abs(a * b) / HCF(a, b);
+        return Math.Abs(a / b) / HCF(a, b);
     }
 }
killedBy: ProjectTests.BasicArithmaticFunctionsTests.GivenNonZeroIntegers_WhenLCM_ThenReturnsLeastCommonMultiple
