[Killed] Logical mutation
git/SimpleTestProject/Project/BasicBooleanFunctions.cs:7:16
 {
     public bool And(bool a, bool b)
     {
-        return a && b;
+        return a || b;
     }
 
killedBy: ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenAnd_ThenReturnsLogicalAnd; ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenNand_ThenReturnsNegationOfAnd; ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenXor_ThenBehavesAsExclusiveOr

[Killed] Logical mutation
git/SimpleTestProject/Project/BasicBooleanFunctions.cs:12:16
 
     public bool Or(bool a, bool b)
     {
-        return a || b;
+        return a && b;
     }
 
killedBy: ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenOr_ThenReturnsLogicalOr; ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenXor_ThenBehavesAsExclusiveOr

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
git/SimpleTestProject/Project/BasicBooleanFunctions.cs:17:16
 
     public bool Not(bool a)
     {
-        return !a;
+        return a;
     }
 
killedBy: ProjectTests.BasicBooleanFunctionsTests.GivenBoolean_WhenNot_ThenReturnsNegation; ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenNand_ThenReturnsNegationOfAnd; ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenXor_ThenBehavesAsExclusiveOr

[Killed] Block removal mutation
git/SimpleTestProject/Project/BasicBooleanFunctions.cs:21:5
     }
 
     public bool Xor(bool a, bool b)
-    {
-        return And(Or(a, b), Not(And(a, b)));
-    }
+    {}
 
     public bool Nand(bool a, bool b)
killedBy: ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenXor_ThenBehavesAsExclusiveOr

[Killed] Block removal mutation
git/SimpleTestProject/Project/BasicBooleanFunctions.cs:26:5
     }
 
     public bool Nand(bool a, bool b)
-    {
-        return Not(And(a, b));
-    }
+    {}
 }
 
killedBy: ProjectTests.BasicBooleanFunctionsTests.GivenTwoBooleans_WhenNand_ThenReturnsNegationOfAnd
