[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:6:35
 {
     public List<int> FilterEvenNumbers(List<int> numbers)
     {
-        return numbers.Where(x => x % 2 == 0).ToList();
+        return numbers.Where(x => x % 2 != 0).ToList();
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenMixedNumbers_WhenFilterEvenNumbers_ThenReturnsOnlyEvens

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:6:35
 {
     public List<int> FilterEvenNumbers(List<int> numbers)
     {
-        return numbers.Where(x => x % 2 == 0).ToList();
+        return numbers.Where(x => x * 2 == 0).ToList();
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenMixedNumbers_WhenFilterEvenNumbers_ThenReturnsOnlyEvens

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:11:33
 
     public bool AreAllEven(List<int> numbers)
     {
-        return numbers.All(x => x % 2 == 0);
+        return numbers.All(x => x % 2 != 0);
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenAllEvenNumbers_WhenAreAllEven_ThenReturnsTrue

[Killed] Linq method mutation (All() to Any())
git/SimpleTestProject/Project/BasicLinqOperation.cs:11:16
 
     public bool AreAllEven(List<int> numbers)
     {
-        return numbers.All(x => x % 2 == 0);
+        return numbers.Any(x => x % 2 == 0);
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenNotAllEvenNumbers_WhenAreAllEven_ThenReturnsFalse

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:16:33
 
     public bool AnyEven(List<int> numbers)
     {
-        return numbers.Any(x => x % 2 == 0);
+        return numbers.Any(x => x * 2 == 0);
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenAtLeastOneEven_WhenAnyEven_ThenReturnsTrue

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:16:33
 
     public bool AnyEven(List<int> numbers)
     {
-        return numbers.Any(x => x % 2 == 0);
+        return numbers.Any(x => x % 2 != 0);
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenNoEven_WhenAnyEven_ThenReturnsFalse

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:21:16
 
     public bool AreMinAndMaxEqual(List<int> numbers)
     {
-        return numbers.Min() == numbers.Max();
+        return numbers.Min() != numbers.Max();
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenUniformElements_WhenAreMinAndMaxEqual_ThenReturnsTrue

[Survived] Linq method mutation (Max() to Min())
git/SimpleTestProject/Project/BasicLinqOperation.cs:21:33
 
     public bool AreMinAndMaxEqual(List<int> numbers)
     {
-        return numbers.Min() == numbers.Max();
+        return numbers.Min() == numbers.Min();
     }
 

[Killed] Linq method mutation (Count() to Sum())
git/SimpleTestProject/Project/BasicLinqOperation.cs:26:33
 
     public bool AnyDuplicated(List<int> numbers)
     {
-        return numbers.Count != numbers.Distinct().Count();
+        return numbers.Count != numbers.Distinct().Sum();
     }
 
killedBy: ProjectTests.BasicLinqOperationTests.GivenAllUnique_WhenAnyDuplicated_ThenReturnsFalse

[Killed] Negate expression
git/SimpleTestProject/Project/BasicLinqOperation.cs:31:13
 
     public bool AnyUnique(List<int> numbers1, List<int> numbers2)
     {
-        if (numbers1.Count == 0 && numbers2.Count == 0)
+        if (!(numbers1.Count == 0 && numbers2.Count == 0))
         {
             return false;
killedBy: ProjectTests.BasicLinqOperationTests.GivenFirstHasUnique_WhenAnyUnique_ThenReturnsTrue

[Survived] Logical mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:31:13
 
     public bool AnyUnique(List<int> numbers1, List<int> numbers2)
     {
-        if (numbers1.Count == 0 && numbers2.Count == 0)
+        if (numbers1.Count == 0 || numbers2.Count == 0)
         {
             return false;

[Survived] Linq method mutation (Except() to Concat())
git/SimpleTestProject/Project/BasicLinqOperation.cs:35:16
         {
             return false;
         }
-        return numbers1.Except(numbers2).Any();
+        return numbers1.Concat(numbers2).Any();
     }
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:40:48
 
     public bool IsOrdered(List<int> numbers)
     {
-        for (int i = 0; i < numbers.Count - 1; i++)
+        for (int i = 0; i < numbers.Count - 1; i--)
         {
             if (numbers[i] > numbers[i + 1])
killedBy: ProjectTests.BasicLinqOperationTests.GivenOrderedList_WhenIsOrdered_ThenReturnsTrue; ProjectTests.BasicLinqOperationTests.GivenUnorderedList_WhenIsOrdered_ThenReturnsFalse

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:40:25
 
     public bool IsOrdered(List<int> numbers)
     {
-        for (int i = 0; i < numbers.Count - 1; i++)
+        for (int i = 0; i <= numbers.Count - 1; i++)
         {
             if (numbers[i] > numbers[i + 1])
killedBy: ProjectTests.BasicLinqOperationTests.GivenEmptyOrSingleElement_WhenIsOrdered_ThenReturnsTrue; ProjectTests.BasicLinqOperationTests.GivenOrderedList_WhenIsOrdered_ThenReturnsTrue

[Killed] Negate expression
git/SimpleTestProject/Project/BasicLinqOperation.cs:42:17
     {
         for (int i = 0; i < numbers.Count - 1; i++)
         {
-            if (numbers[i] > numbers[i + 1])
+            if (!(numbers[i] > numbers[i + 1]))
             {
                 return false;
killedBy: ProjectTests.BasicLinqOperationTests.GivenOrderedList_WhenIsOrdered_ThenReturnsTrue

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:42:17
     {
         for (int i = 0; i < numbers.Count - 1; i++)
         {
-            if (numbers[i] > numbers[i + 1])
+            if (numbers[i] < numbers[i + 1])
             {
                 return false;
killedBy: ProjectTests.BasicLinqOperationTests.GivenOrderedList_WhenIsOrdered_ThenReturnsTrue

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:52:45
 
     public bool IsOrdered<T>(List<T> list, Func<T, T, int> comparitor)
     {
-        for (int i = 0; i < list.Count - 1; i++)
+        for (int i = 0; i < list.Count - 1; i--)
         {
             if (comparitor.Invoke(list[i], list[i + 1]) == 0)

[NoCoverage] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:52:25
 
     public bool IsOrdered<T>(List<T> list, Func<T, T, int> comparitor)
     {
-        for (int i = 0; i < list.Count - 1; i++)
+        for (int i = 0; i <= list.Count - 1; i++)
         {
             if (comparitor.Invoke(list[i], list[i + 1]) == 0)

[NoCoverage] Equality mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:54:17
     {
         for (int i = 0; i < list.Count - 1; i++)
         {
-            if (comparitor.Invoke(list[i], list[i + 1]) == 0)
+            if (comparitor.Invoke(list[i], list[i + 1]) != 0)
             {
                 return false;

[NoCoverage] Arithmetic mutation
git/SimpleTestProject/Project/BasicLinqOperation.cs:54:49
     {
         for (int i = 0; i < list.Count - 1; i++)
         {
-            if (comparitor.Invoke(list[i], list[i + 1]) == 0)
+            if (comparitor.Invoke(list[i], list[i - 1]) == 0)
             {
                 return false;
