[Killed] Block removal mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:6:5
 public class BasicStringFunctions
 {
     public string Concatenate(string str1, string str2)
-    {
-        return str1 + str2;
-    }
+    {}
 
     public string ToUpperCase(string str)
killedBy: ProjectTests.BasicStringFunctionsTests.GivenTwoStrings_WhenConcatenate_ThenReturnsJoinedString

[Killed] Block removal mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:11:5
     }
 
     public string ToUpperCase(string str)
-    {
-        return str.ToUpper();
-    }
+    {}
 
     public string ToLowerCase(string str)
killedBy: ProjectTests.BasicStringFunctionsTests.GivenMixedCaseString_WhenToUpperCase_ThenReturnsUppercase

[Killed] Block removal mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:16:5
     }
 
     public string ToLowerCase(string str)
-    {
-        return str.ToLower();
-    }
+    {}
 
     public string Reverse(string str)
killedBy: ProjectTests.BasicStringFunctionsTests.GivenMixedCaseString_WhenToLowerCase_ThenReturnsLowercase

[Killed] Statement mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:23:9
     public string Reverse(string str)
     {
         char[] charArray = str.ToCharArray();
-        Array.Reverse(charArray);
+        ;
         return new string(charArray);
     }
killedBy: ProjectTests.BasicStringFunctionsTests.GivenString_WhenReverse_ThenReturnsReversedString

[Killed] Equality mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:29:13
 
     public string GetSubstring(string str, int startIndex, int length)
     {
-        if (startIndex < 0 || length < 0 || startIndex + length > str.Length)
+        if (startIndex > 0 || length < 0 || startIndex + length > str.Length)
         {
             throw new ArgumentOutOfRangeException("Invalid startIndex or length for substring.");
killedBy: ProjectTests.BasicStringFunctionsTests.GivenValidIndices_WhenGetSubstring_ThenReturnsSubstring

[Killed] Negate expression
git/SimpleTestProject/Project/BasicStringFunctions.cs:29:13
 
     public string GetSubstring(string str, int startIndex, int length)
     {
-        if (startIndex < 0 || length < 0 || startIndex + length > str.Length)
+        if (!(startIndex < 0 || length < 0 || startIndex + length > str.Length))
         {
             throw new ArgumentOutOfRangeException("Invalid startIndex or length for substring.");
killedBy: ProjectTests.BasicStringFunctionsTests.GivenValidIndices_WhenGetSubstring_ThenReturnsSubstring

[Survived] Statement mutation
git/SimpleTestProject/Project/BasicStringFunctions.cs:31:13
     {
         if (startIndex < 0 || length < 0 || startIndex + length > str.Length)
         {
-            throw new ArgumentOutOfRangeException("Invalid startIndex or length for substring.");
+            ;
         }
         return str.Substring(startIndex, length);
