[Killed] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:8:5
     private readonly IOrderChecker _orderChecker;
 
     public BinarySearch(IOrderChecker orderChecker)
-    {
-        _orderChecker = orderChecker;
-    }
+    {}
 
     public int? NumericBinarySearch(List<int> numbers, int target)
killedBy: ProjectTests.BinarySearchTests.GivenComparatorReturnsInvalidValue_WhenGenericBinarySearch_ThenThrowsArgumentOutOfRangeException; ProjectTests.BinarySearchTests.GivenEmptyList_WhenGenericBinarySearch_ThenReturnsNull; ProjectTests.BinarySearchTests.GivenOrderedGenericList_WhenGenericBinarySearch_WithCustomComparer_ThenReturnsIndex

[Killed] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:13:5
     }
 
     public int? NumericBinarySearch(List<int> numbers, int target)
-    {
-        return GenericBinarySearch(numbers, NumericComapritor, target);
-    }
+    {}
 
     /// <summary>
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex

[Timeout] LogicalNotExpression to un-LogicalNotExpression mutation
git/SimpleTestProject/Project/BinarySearch.cs:30:13
     /// <returns>null if the targter is not found, otherwise the index of the item.</returns>
     public int? GenericBinarySearch<T>(List<T> list, Func<T, T, int> comparitor, T target)
     {
-        if (!_orderChecker.IsOrdered(list, comparitor))
+        if (_orderChecker.IsOrdered(list, comparitor))
         {
             return null;

[Killed] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:31:9
     public int? GenericBinarySearch<T>(List<T> list, Func<T, T, int> comparitor, T target)
     {
         if (!_orderChecker.IsOrdered(list, comparitor))
-        {
-            return null;
-        }
+        {}
 
         int start = 0;
killedBy: ProjectTests.BinarySearchTests.GivenUnorderedNumericList_WhenNumericBinarySearch_ThenReturnsNull

[Killed] Negate expression
git/SimpleTestProject/Project/BinarySearch.cs:43:13
 
     private int? SearchListSection<T>(List<T> list, int start, int end, T target, Func<T, T, int> comparitor)
     {
-        if (start > end)
+        if (!(start > end))
         {
             return null;
killedBy: ProjectTests.BinarySearchTests.GivenComparatorReturnsInvalidValue_WhenGenericBinarySearch_ThenThrowsArgumentOutOfRangeException; ProjectTests.BinarySearchTests.GivenEmptyList_WhenGenericBinarySearch_ThenReturnsNull; ProjectTests.BinarySearchTests.GivenOrderedGenericList_WhenGenericBinarySearch_WithCustomComparer_ThenReturnsIndex

[Killed] Equality mutation
git/SimpleTestProject/Project/BinarySearch.cs:43:13
 
     private int? SearchListSection<T>(List<T> list, int start, int end, T target, Func<T, T, int> comparitor)
     {
-        if (start > end)
+        if (start >= end)
         {
             return null;
killedBy: ProjectTests.BinarySearchTests.GivenComparatorReturnsInvalidValue_WhenGenericBinarySearch_ThenThrowsArgumentOutOfRangeException; ProjectTests.BinarySearchTests.GivenSingleItemList_WhenGenericBinarySearch_TargetIsItem_ThenReturnsZero

[Killed] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:44:9
     private int? SearchListSection<T>(List<T> list, int start, int end, T target, Func<T, T, int> comparitor)
     {
         if (start > end)
-        {
-            return null;
-        }
+        {}
         
         int center = start + (end - start)/2;
killedBy: ProjectTests.BinarySearchTests.GivenEmptyList_WhenGenericBinarySearch_ThenReturnsNull; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetMissing_ThenReturnsNull

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BinarySearch.cs:48:30
             return null;
         }
         
-        int center = start + (end - start)/2;
+        int center = start + (end - start)*2;
         int comparisonResult = comparitor.Invoke(list[center], target);
         switch (comparisonResult)
killedBy: ProjectTests.BinarySearchTests.GivenOrderedGenericList_WhenGenericBinarySearch_WithCustomComparer_ThenReturnsIndex; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetMissing_ThenReturnsNull

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/BinarySearch.cs:48:31
             return null;
         }
         
-        int center = start + (end - start)/2;
+        int center = start + (end + start)/2;
         int comparisonResult = comparitor.Invoke(list[center], target);
         switch (comparisonResult)
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetMissing_ThenReturnsNull

[Timeout] Arithmetic mutation
git/SimpleTestProject/Project/BinarySearch.cs:55:48
             case 0:
                 return center;
             case 1:
-                return SearchListSection(list, center+1, end, target, comparitor);
+                return SearchListSection(list, center-1, end, target, comparitor);
             case -1:
                 return SearchListSection(list, start, center-1, target, comparitor);

[NoCoverage] Arithmetic mutation
git/SimpleTestProject/Project/BinarySearch.cs:57:55
             case 1:
                 return SearchListSection(list, center+1, end, target, comparitor);
             case -1:
-                return SearchListSection(list, start, center-1, target, comparitor);
+                return SearchListSection(list, start, center+1, target, comparitor);
             default:
                 throw new ArgumentOutOfRangeException("Comapritor function should only return -1, 0, or 1");

[Survived] String mutation
git/SimpleTestProject/Project/BinarySearch.cs:59:55
             case -1:
                 return SearchListSection(list, start, center-1, target, comparitor);
             default:
-                throw new ArgumentOutOfRangeException("Comapritor function should only return -1, 0, or 1");
+                throw new ArgumentOutOfRangeException("");
         }
     }

[Killed] Negate expression
git/SimpleTestProject/Project/BinarySearch.cs:65:13
 
     private int NumericComapritor(int a, int target)
     {
-        if (a > target)
+        if (!(a > target))
         {
             return -1;
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex

[Killed] Equality mutation
git/SimpleTestProject/Project/BinarySearch.cs:65:13
 
     private int NumericComapritor(int a, int target)
     {
-        if (a > target)
+        if (a >= target)
         {
             return -1;
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
git/SimpleTestProject/Project/BinarySearch.cs:67:20
     {
         if (a > target)
         {
-            return -1;
+            return +1;
         }
         if (a < target)

[Killed] Equality mutation
git/SimpleTestProject/Project/BinarySearch.cs:69:13
         {
             return -1;
         }
-        if (a < target)
+        if (a <= target)
         {
             return 1;
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex

[Killed] Equality mutation
git/SimpleTestProject/Project/BinarySearch.cs:69:13
         {
             return -1;
         }
-        if (a < target)
+        if (a > target)
         {
             return 1;
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetMissing_ThenReturnsNull

[Killed] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:70:9
             return -1;
         }
         if (a < target)
-        {
-            return 1;
-        } 
+        {} 
         else
         {
killedBy: ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetExists_ThenReturnsIndex; ProjectTests.BinarySearchTests.GivenOrderedNumericList_WhenNumericBinarySearch_TargetMissing_ThenReturnsNull

[Survived] Block removal mutation
git/SimpleTestProject/Project/BinarySearch.cs:74:9
             return 1;
         } 
         else
-        {
-            return 0;
-        }
+        {}
     }
 }
