[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:10:25
 
     public int[,] CalculateDotProduct(List<int[,]> matricies)
     {
-        for (int i = 0; i < matricies.Count - 1; i++)
+        for (int i = 0; i <= matricies.Count - 1; i++)
         {
             if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenSingleMatrixInList_WhenCalculateDotProductList_ThenReturnsTheSameMatrixAndNoMultiplicationsOccur

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:10:50
 
     public int[,] CalculateDotProduct(List<int[,]> matricies)
     {
-        for (int i = 0; i < matricies.Count - 1; i++)
+        for (int i = 0; i < matricies.Count - 1; i--)
         {
             if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:12:17
     {
         for (int i = 0; i < matricies.Count - 1; i++)
         {
-            if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
+            if (matricies[i].GetLength(1) == matricies[i + 1].GetLength(0))
             {
                 throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B for all consecutive matricies.");
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:12:56
     {
         for (int i = 0; i < matricies.Count - 1; i++)
         {
-            if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
+            if (matricies[i].GetLength(1) != matricies[i - 1].GetLength(0))
             {
                 throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B for all consecutive matricies.");
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenIncompatibleConsecutiveMatrices_WhenCalculateDotProductList_ThenThrowsArgumentException

[Survived] Statement mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:14:17
         {
             if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
             {
-                throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B for all consecutive matricies.");
+                ;
             }
         }

[Survived] String mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:14:45
         {
             if (matricies[i].GetLength(1) != matricies[i + 1].GetLength(0))
             {
-                throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B for all consecutive matricies.");
+                throw new ArgumentException("");
             }
         }

[Timeout] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:25:13
 
     private int[,] ComputeMatriciesDotProduct(List<int[,]> matricies, int[,] factorMatrix, int startIndex, int endIndex)
     {
-        if (startIndex == endIndex)
+        if (startIndex != endIndex)
         {
             return matricies[startIndex];

[Timeout] Block removal mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:26:9
     private int[,] ComputeMatriciesDotProduct(List<int[,]> matricies, int[,] factorMatrix, int startIndex, int endIndex)
     {
         if (startIndex == endIndex)
-        {
-            return matricies[startIndex];
-        }
+        {}
         
         int splitIndex = factorMatrix[startIndex, endIndex];

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:33:65
         int splitIndex = factorMatrix[startIndex, endIndex];
         return CalculateDotProduct(
             ComputeMatriciesDotProduct(matricies, factorMatrix, startIndex, splitIndex),
-            ComputeMatriciesDotProduct(matricies, factorMatrix, splitIndex + 1, endIndex)
+            ComputeMatriciesDotProduct(matricies, factorMatrix, splitIndex - 1, endIndex)
         );
     }
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:42:46
         int[,] costsMatrix = new int[matricies.Count, matricies.Count];
         int[,] factorMatrix = new int[matricies.Count, matricies.Count];
 
-        for (int i = 0; i < matricies.Count; i++)
+        for (int i = 0; i < matricies.Count; i--)
         {
             costsMatrix[i, i] = 0;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenSingleMatrixInList_WhenCalculateDotProductList_ThenReturnsTheSameMatrixAndNoMultiplicationsOccur

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:42:25
         int[,] costsMatrix = new int[matricies.Count, matricies.Count];
         int[,] factorMatrix = new int[matricies.Count, matricies.Count];
 
-        for (int i = 0; i < matricies.Count; i++)
+        for (int i = 0; i <= matricies.Count; i++)
         {
             costsMatrix[i, i] = 0;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenSingleMatrixInList_WhenCalculateDotProductList_ThenReturnsTheSameMatrixAndNoMultiplicationsOccur

[Survived] Block removal mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:43:9
         int[,] factorMatrix = new int[matricies.Count, matricies.Count];
 
         for (int i = 0; i < matricies.Count; i++)
-        {
-            costsMatrix[i, i] = 0;
-        }
+        {}
 
         for (int diagonal = 2; diagonal <= matricies.Count; diagonal++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:47:61
             costsMatrix[i, i] = 0;
         }
 
-        for (int diagonal = 2; diagonal <= matricies.Count; diagonal++)
+        for (int diagonal = 2; diagonal <= matricies.Count; diagonal--)
         {
             for (int i = 0; i <= matricies.Count - diagonal; i++)
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Survived] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:47:32
             costsMatrix[i, i] = 0;
         }
 
-        for (int diagonal = 2; diagonal <= matricies.Count; diagonal++)
+        for (int diagonal = 2; diagonal < matricies.Count; diagonal++)
         {
             for (int i = 0; i <= matricies.Count - diagonal; i++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:49:62
 
         for (int diagonal = 2; diagonal <= matricies.Count; diagonal++)
         {
-            for (int i = 0; i <= matricies.Count - diagonal; i++)
+            for (int i = 0; i <= matricies.Count - diagonal; i--)
             {
                 int j = i + diagonal - 1;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Timeout] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:49:29
 
         for (int diagonal = 2; diagonal <= matricies.Count; diagonal++)
         {
-            for (int i = 0; i <= matricies.Count - diagonal; i++)
+            for (int i = 0; i < matricies.Count - diagonal; i++)
             {
                 int j = i + diagonal - 1;

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:51:25
         {
             for (int i = 0; i <= matricies.Count - diagonal; i++)
             {
-                int j = i + diagonal - 1;
+                int j = i - diagonal - 1;
                 costsMatrix[i, j] = int.MaxValue;
                 for (int k = i; k < j; k++)
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:51:25
         {
             for (int i = 0; i <= matricies.Count - diagonal; i++)
             {
-                int j = i + diagonal - 1;
+                int j = i + diagonal + 1;
                 costsMatrix[i, j] = int.MaxValue;
                 for (int k = i; k < j; k++)
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:53:40
             {
                 int j = i + diagonal - 1;
                 costsMatrix[i, j] = int.MaxValue;
-                for (int k = i; k < j; k++)
+                for (int k = i; k < j; k--)
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:53:33
             {
                 int j = i + diagonal - 1;
                 costsMatrix[i, j] = int.MaxValue;
-                for (int k = i; k < j; k++)
+                for (int k = i; k <= j; k++)
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:55:32
                 costsMatrix[i, j] = int.MaxValue;
                 for (int k = i; k < j; k++)
                 {
-                    int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
-                               matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
+                    int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] -
+                               matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
                     if (cost < costsMatrix[i, j])
                     {
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:55:64
                 costsMatrix[i, j] = int.MaxValue;
                 for (int k = i; k < j; k++)
                 {
-                    int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
+                    int cost = costsMatrix[i, k] + costsMatrix[k - 1, j] +
                                matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
                     if (cost < costsMatrix[i, j])
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:56:32
                 for (int k = i; k < j; k++)
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
-                               matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
+                               matricies[i].GetLength(0) / matricies[k].GetLength(1) * matricies[j].GetLength(1);
                     if (cost < costsMatrix[i, j])
                     {
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Survived] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:56:32
                 for (int k = i; k < j; k++)
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
-                               matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
+                               matricies[i].GetLength(0) * matricies[k].GetLength(1) / matricies[j].GetLength(1);
                     if (cost < costsMatrix[i, j])
                     {

[Timeout] Negate expression
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:57:25
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
                                matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
-                    if (cost < costsMatrix[i, j])
+                    if (!(cost < costsMatrix[i, j]))
                     {
                         costsMatrix[i, j] = cost;

[Survived] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:57:25
                 {
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
                                matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
-                    if (cost < costsMatrix[i, j])
+                    if (cost <= costsMatrix[i, j])
                     {
                         costsMatrix[i, j] = cost;

[Timeout] Block removal mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:58:21
                     int cost = costsMatrix[i, k] + costsMatrix[k + 1, j] +
                                matricies[i].GetLength(0) * matricies[k].GetLength(1) * matricies[j].GetLength(1);
                     if (cost < costsMatrix[i, j])
-                    {
-                        costsMatrix[i, j] = cost;
-                        factorMatrix[i, j] = k;
-                    }
+                    {}
                 }
             }

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:75:13
         int colsA = matrixA.GetLength(1);
         int rowsB = matrixB.GetLength(0);
         int colsB = matrixB.GetLength(1);
-        if (colsA != rowsB)
+        if (colsA == rowsB)
         {
             throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B.");
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[NoCoverage] Statement mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:77:13
         int colsB = matrixB.GetLength(1);
         if (colsA != rowsB)
         {
-            throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B.");
+            ;
         }
         int[,] result = new int[rowsA, colsB];

[NoCoverage] String mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:77:41
         int colsB = matrixB.GetLength(1);
         if (colsA != rowsB)
         {
-            throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B.");
+            throw new ArgumentException("");
         }
         int[,] result = new int[rowsA, colsB];

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:80:36
             throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B.");
         }
         int[,] result = new int[rowsA, colsB];
-        for (int i = 0; i < rowsA; i++)
+        for (int i = 0; i < rowsA; i--)
         {
             for (int j = 0; j < colsB; j++)
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:80:25
             throw new ArgumentException("Number of columns in Matrix A must equal number of rows in Matrix B.");
         }
         int[,] result = new int[rowsA, colsB];
-        for (int i = 0; i < rowsA; i++)
+        for (int i = 0; i <= rowsA; i++)
         {
             for (int j = 0; j < colsB; j++)
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:82:29
         int[,] result = new int[rowsA, colsB];
         for (int i = 0; i < rowsA; i++)
         {
-            for (int j = 0; j < colsB; j++)
+            for (int j = 0; j <= colsB; j++)
             {
                 int sum = 0;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:82:29
         int[,] result = new int[rowsA, colsB];
         for (int i = 0; i < rowsA; i++)
         {
-            for (int j = 0; j < colsB; j++)
+            for (int j = 0; j > colsB; j++)
             {
                 int sum = 0;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:85:44
             for (int j = 0; j < colsB; j++)
             {
                 int sum = 0;
-                for (int k = 0; k < colsA; k++)
+                for (int k = 0; k < colsA; k--)
                 {
                     sum += matrixA[i, k] * matrixB[k, j];
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] Equality mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:85:33
             for (int j = 0; j < colsB; j++)
             {
                 int sum = 0;
-                for (int k = 0; k < colsA; k++)
+                for (int k = 0; k > colsA; k++)
                 {
                     sum += matrixA[i, k] * matrixB[k, j];
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:87:21
                 int sum = 0;
                 for (int k = 0; k < colsA; k++)
                 {
-                    sum += matrixA[i, k] * matrixB[k, j];
+                    sum -= matrixA[i, k] * matrixB[k, j];
                     MatrixMultiplicationCount++;
                 }
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:87:28
                 int sum = 0;
                 for (int k = 0; k < colsA; k++)
                 {
-                    sum += matrixA[i, k] * matrixB[k, j];
+                    sum += matrixA[i, k] / matrixB[k, j];
                     MatrixMultiplicationCount++;
                 }
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications

[Killed] Statement mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:88:21
                 for (int k = 0; k < colsA; k++)
                 {
                     sum += matrixA[i, k] * matrixB[k, j];
-                    MatrixMultiplicationCount++;
+                    ;
                 }
                 result[i, j] = sum;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MatrixDotProductCalculator.cs:88:21
                 for (int k = 0; k < colsA; k++)
                 {
                     sum += matrixA[i, k] * matrixB[k, j];
-                    MatrixMultiplicationCount++;
+                    MatrixMultiplicationCount--;
                 }
                 result[i, j] = sum;
killedBy: ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatrices30x1_1x40_40x10_10x25_WhenCalculateDotProduct_ThenReturnsExpected30x25ResultAndUsesOptimalMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenChainOfMatricesWithNonUnityValues_WhenCalculateDotProduct_ThenReturnsExpectedScaledValuesAndCountsMultiplications; ProjectTests.MatrixDotProductCalculatorTests.GivenTwoCompatibleMatrices_WhenCalculateDotProduct_TwoMatrixProductIsCorrectAndCountsMultiplications
