[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:12:13
         //This accounts for spilitting the list in half recursively, but doing it one step.
         foreach (T item in list)
         {
-            disassambedList.Add(new List<T> { item });
+            ;
         }
 
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList; ProjectTests.MergeSorterTests.GivenUnsortedStringList_WhenMergeSort_WithCustomComparer_ThenReturnsSortedAscendingList

[Killed] Collection initializer mutation
git/SimpleTestProject/Project/MergeSorter.cs:12:33
         //This accounts for spilitting the list in half recursively, but doing it one step.
         foreach (T item in list)
         {
-            disassambedList.Add(new List<T> { item });
+            disassambedList.Add(new List<T> {});
         }
 
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenSingleElementList_WhenMergeSort_ThenReturnsSameSingleElementList

[Killed] Negate expression
git/SimpleTestProject/Project/MergeSorter.cs:15:16
             disassambedList.Add(new List<T> { item });
         }
 
-        while (disassambedList.Count > 1)
+        while (!(disassambedList.Count > 1))
         {
             //Iterate over every pair of lists, merging them into a single sorted list.
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder

[Timeout] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:15:16
             disassambedList.Add(new List<T> { item });
         }
 
-        while (disassambedList.Count > 1)
+        while (disassambedList.Count >= 1)
         {
             //Iterate over every pair of lists, merging them into a single sorted list.

[Killed] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:19:29
         {
             //Iterate over every pair of lists, merging them into a single sorted list.
             List<List<T>> mergedLists = new List<List<T>>();
-            for (int i = 0; i < disassambedList.Count; i += 2)
+            for (int i = 0; i <= disassambedList.Count; i += 2)
             {
                 if (i + 1 < disassambedList.Count)
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
git/SimpleTestProject/Project/MergeSorter.cs:19:56
         {
             //Iterate over every pair of lists, merging them into a single sorted list.
             List<List<T>> mergedLists = new List<List<T>>();
-            for (int i = 0; i < disassambedList.Count; i += 2)
+            for (int i = 0; i < disassambedList.Count; i -= 2)
             {
                 if (i + 1 < disassambedList.Count)
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MergeSorter.cs:21:21
             List<List<T>> mergedLists = new List<List<T>>();
             for (int i = 0; i < disassambedList.Count; i += 2)
             {
-                if (i + 1 < disassambedList.Count)
+                if (i - 1 < disassambedList.Count)
                 {
                     List<T> merged = MergeSortedLists(disassambedList[i], disassambedList[i + 1], comparitor);
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Negate expression
git/SimpleTestProject/Project/MergeSorter.cs:21:21
             List<List<T>> mergedLists = new List<List<T>>();
             for (int i = 0; i < disassambedList.Count; i += 2)
             {
-                if (i + 1 < disassambedList.Count)
+                if (!(i + 1 < disassambedList.Count))
                 {
                     List<T> merged = MergeSortedLists(disassambedList[i], disassambedList[i + 1], comparitor);
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MergeSorter.cs:23:91
             {
                 if (i + 1 < disassambedList.Count)
                 {
-                    List<T> merged = MergeSortedLists(disassambedList[i], disassambedList[i + 1], comparitor);
+                    List<T> merged = MergeSortedLists(disassambedList[i], disassambedList[i - 1], comparitor);
                     mergedLists.Add(merged);
                 }
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:24:21
                 if (i + 1 < disassambedList.Count)
                 {
                     List<T> merged = MergeSortedLists(disassambedList[i], disassambedList[i + 1], comparitor);
-                    mergedLists.Add(merged);
+                    ;
                 }
                 else
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:30:21
                 {
                     //If we have reached the end of the list and there is an odd number of lists,
                     //The final list is added as-is because there is nothing to comapre it to.
-                    mergedLists.Add(disassambedList[i]);
+                    ;
                 }
             }
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Linq method mutation (FirstOrDefault() to First())
git/SimpleTestProject/Project/MergeSorter.cs:36:16
             disassambedList = mergedLists;
         }
 
-        return disassambedList.FirstOrDefault() ?? list; //If the input list was empty, return it as-is.
+        return disassambedList.First() ?? list; //If the input list was empty, return it as-is.
     }
 
killedBy: ProjectTests.MergeSorterTests.GivenEmptyList_WhenMergeSort_ThenReturnsEmptyList

[Killed] Null coalescing mutation (remove left)
git/SimpleTestProject/Project/MergeSorter.cs:36:16
             disassambedList = mergedLists;
         }
 
-        return disassambedList.FirstOrDefault() ?? list; //If the input list was empty, return it as-is.
+        return list; //If the input list was empty, return it as-is.
     }
 
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList; ProjectTests.MergeSorterTests.GivenUnsortedStringList_WhenMergeSort_WithCustomComparer_ThenReturnsSortedAscendingList

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
git/SimpleTestProject/Project/MergeSorter.cs:41:34
 
     private List<T> MergeSortedLists<T>(List<T> leftHalf, List<T> rightHalf, Func<T, T, int> comparitor)
     {
-        int previousAddedIndex = -1;
+        int previousAddedIndex = +1;
         while (rightHalf.Count > 0)
         {
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Negate expression
git/SimpleTestProject/Project/MergeSorter.cs:42:16
     private List<T> MergeSortedLists<T>(List<T> leftHalf, List<T> rightHalf, Func<T, T, int> comparitor)
     {
         int previousAddedIndex = -1;
-        while (rightHalf.Count > 0)
+        while (!(rightHalf.Count > 0))
         {
             T itemToAdd = rightHalf[0];
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:42:16
     private List<T> MergeSortedLists<T>(List<T> leftHalf, List<T> rightHalf, Func<T, T, int> comparitor)
     {
         int previousAddedIndex = -1;
-        while (rightHalf.Count > 0)
+        while (rightHalf.Count >= 0)
         {
             T itemToAdd = rightHalf[0];
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList; ProjectTests.MergeSorterTests.GivenUnsortedStringList_WhenMergeSort_WithCustomComparer_ThenReturnsSortedAscendingList

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:45:13
         while (rightHalf.Count > 0)
         {
             T itemToAdd = rightHalf[0];
-            rightHalf.RemoveAt(0);
+            ;
             int leftHalfInitialCount = leftHalf.Count;
 
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MergeSorter.cs:48:26
             rightHalf.RemoveAt(0);
             int leftHalfInitialCount = leftHalf.Count;
 
-            for (int i = previousAddedIndex + 1; i < leftHalf.Count; i++)
+            for (int i = previousAddedIndex - 1; i < leftHalf.Count; i++)
             {
                 int comparisonResult = comparitor.Invoke(leftHalf[i], itemToAdd);
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] PostIncrementExpression to PostDecrementExpression mutation
git/SimpleTestProject/Project/MergeSorter.cs:48:70
             rightHalf.RemoveAt(0);
             int leftHalfInitialCount = leftHalf.Count;
 
-            for (int i = previousAddedIndex + 1; i < leftHalf.Count; i++)
+            for (int i = previousAddedIndex + 1; i < leftHalf.Count; i--)
             {
                 int comparisonResult = comparitor.Invoke(leftHalf[i], itemToAdd);
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
git/SimpleTestProject/Project/MergeSorter.cs:51:41
             for (int i = previousAddedIndex + 1; i < leftHalf.Count; i++)
             {
                 int comparisonResult = comparitor.Invoke(leftHalf[i], itemToAdd);
-                if (comparisonResult == -1)
+                if (comparisonResult == +1)
                 {
                     //If the item in the left half is larger than the item to add,
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:51:21
             for (int i = previousAddedIndex + 1; i < leftHalf.Count; i++)
             {
                 int comparisonResult = comparitor.Invoke(leftHalf[i], itemToAdd);
-                if (comparisonResult == -1)
+                if (comparisonResult != -1)
                 {
                     //If the item in the left half is larger than the item to add,
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:55:21
                 {
                     //If the item in the left half is larger than the item to add,
                     //we insert the new item before the existing one.
-                    leftHalf.Insert(i, itemToAdd);
+                    ;
                     previousAddedIndex = i;
                     break;
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList; ProjectTests.MergeSorterTests.GivenUnsortedStringList_WhenMergeSort_WithCustomComparer_ThenReturnsSortedAscendingList

[Timeout] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:57:21
                     //we insert the new item before the existing one.
                     leftHalf.Insert(i, itemToAdd);
                     previousAddedIndex = i;
-                    break;
+                    ;
                 }
                 else if (comparisonResult == 0)

[Killed] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:59:26
                     previousAddedIndex = i;
                     break;
                 }
-                else if (comparisonResult == 0)
+                else if (comparisonResult != 0)
                 {
                     //If the items are equal, we insert the new item after the existing one.
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Arithmetic mutation
git/SimpleTestProject/Project/MergeSorter.cs:62:37
                 else if (comparisonResult == 0)
                 {
                     //If the items are equal, we insert the new item after the existing one.
-                    leftHalf.Insert(i + 1, itemToAdd);
+                    leftHalf.Insert(i - 1, itemToAdd);
                     previousAddedIndex = i + 1;
                     break;
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:62:21
                 else if (comparisonResult == 0)
                 {
                     //If the items are equal, we insert the new item after the existing one.
-                    leftHalf.Insert(i + 1, itemToAdd);
+                    ;
                     previousAddedIndex = i + 1;
                     break;
killedBy: ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates

[Survived] Arithmetic mutation
git/SimpleTestProject/Project/MergeSorter.cs:63:42
                 {
                     //If the items are equal, we insert the new item after the existing one.
                     leftHalf.Insert(i + 1, itemToAdd);
-                    previousAddedIndex = i + 1;
+                    previousAddedIndex = i - 1;
                     break;
                 }

[Timeout] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:64:21
                     //If the items are equal, we insert the new item after the existing one.
                     leftHalf.Insert(i + 1, itemToAdd);
                     previousAddedIndex = i + 1;
-                    break;
+                    ;
                 }
                 //If we reach here, it means the item in the left half is smaller than the item to add.

[Killed] Equality mutation
git/SimpleTestProject/Project/MergeSorter.cs:68:21
                 }
                 //If we reach here, it means the item in the left half is smaller than the item to add.
 
-                if (i == leftHalf.Count - 1)
+                if (i != leftHalf.Count - 1)
                 {
                     //If we reach the end of the left half without inserting the right item,
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates; ProjectTests.MergeSorterTests.GivenUnsortedIntegerList_WhenMergeSort_ThenReturnsSortedAscendingList

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:73:21
                     //If we reach the end of the left half without inserting the right item,
                     //it means the right item is larger than all items in the left half.
                     //And since we know the right half is sorted, we can just add the rest of it to the end.
-                    leftHalf.Add(itemToAdd);
+                    ;
                     leftHalf.AddRange(rightHalf);
                     return leftHalf;
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder; ProjectTests.MergeSorterTests.GivenListWithDuplicates_WhenMergeSort_ThenReturnsSortedListPreservingDuplicates

[Killed] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:74:21
                     //it means the right item is larger than all items in the left half.
                     //And since we know the right half is sorted, we can just add the rest of it to the end.
                     leftHalf.Add(itemToAdd);
-                    leftHalf.AddRange(rightHalf);
+                    ;
                     return leftHalf;
                 }
killedBy: ProjectTests.MergeSorterTests.GivenAlreadySortedIntegerList_WhenMergeSort_ThenReturnsSameOrder

[NoCoverage] Statement mutation
git/SimpleTestProject/Project/MergeSorter.cs:80:17
             }
             if (leftHalf.Count == leftHalfInitialCount)
             {
-                throw new Exception($"Merge sort failed to insert an item into the merged list. item: {itemToAdd}");
+                ;
             }
         }

[NoCoverage] String mutation
git/SimpleTestProject/Project/MergeSorter.cs:80:37
             }
             if (leftHalf.Count == leftHalfInitialCount)
             {
-                throw new Exception($"Merge sort failed to insert an item into the merged list. item: {itemToAdd}");
+                throw new Exception($"");
             }
         }
